groups.yml
config:
  target: "http:/"
  plugins:
    expect: {}
  phases:
    - duration: 700
      arrivalRate: 1
      maxVusers: 1
  defaults:
    headers:
      authorization: "a"
  processor: "functions.js"
  payload:
    - path: "devices.csv"
      fields:
        - "device_id"
      order: sequence
      delimiter: ","
      skipHeader: true

scenarios:
  - name: "Create Groups: {{ group_id }}"
    flow:
      - log: "POST Login"
      - post:
          url: "/pm-user-management:3000/api/v1/auth/login"
          json:
            username: "adriana"
            password: "123456"
          capture:
            - json: "$.token.access_token"
              as: "auth_token"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: token

      - function: "getRandomImagePath"
      - log: "POST Group: {{ group_id }}"
      - post:
          url: "/system-management:8080/sm/api/v1/group-management/groups"
          headers:
            authorization: "Bearer {{ auth_token }}"
          json:
            id: "{{ group_id }}"
            description: "description of {{ group_id }}"
            active: true
            image_path: "{{ image_path }}"